app/views/lawsuits/edit.html.erb

    <%= f.label :venue_id %>
    <%= f.collection_select(:venue_id, Venue.all, :id, :name, {include_blank: true})%>
---
SELECT "venues".* FROM "venues"

    <%= f.label :kind_id %>
    <%= f.collection_select(:kind_id, Kind.all, :id, :name, {include_blank: true})%>
---
SELECT "kinds".* FROM "kinds"

    <%= f.label :status_id %>
    <%= f.collection_select(:status_id, Status.all, :id, :name, {include_blank: true})%>
---
SELECT "statuses".* FROM "statuses"