app/views/lawsuits/show.html.erb

  <tbody>
    <% @lawsuit.observations.each do |observation| %>
---
SELECT "observations".* FROM "observations" WHERE "observations"."lawsuit_id" = ?  [["lawsuit_id", 8]]