app/views/clients/show.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Country:</strong>
  <%= @client.address.country %>