app/views/data_users/_form.html.erb

    <%= f.label :office_id %>
    <%= f.collection_select(:office_id, Office.all, :id, :name, {include_blank: true})%>
---
SELECT "offices".* FROM "offices"