app/controllers/clients_controller.rb

  def index
    if params[:search]
      @clients = Client.where(cpf: params[:search])
      if @clients == []
        respond_to do |format|
            format.html { redirect_to clients_url, notice: 'Não foi encontrado.' }
        end
      end
    else
    @clients = Client.all.paginate(page: params[:page], per_page: 4)
---
SELECT "clients".* FROM "clients" WHERE "clients"."cpf" = ?  [["cpf", ""]]
SELECT "clients".* FROM "clients"
SELECT COUNT(*) FROM "clients" WHERE "clients"."cpf" = ?  [["cpf", "3"]]

  def create
    @client = Client.new(client_params)
    @client.user_id = current_user.id
    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "born", "sex", "cpf", "rg", "email", "telephone", "celphone", "bio", "user_id", "created_at", "updated_at", "address_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)