app/controllers/comments_controller.rb

INSERT INTO "comments" ("description", "lawsuit_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "restnasda"], ["lawsuit_id", 8], ["user_id", 1], ["created_at", 2016-11-14 13:40:19 UTC], ["updated_at", 2016-11-14 13:40:19 UTC]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save