app/controllers/data_users_controller.rb

  def index
    @data_users = DataUser.all
---
SELECT "data_users".* FROM "data_users"

  def create
    @data_user = DataUser.new(data_user_params)

    respond_to do |format|
      if @data_user.save
---
INSERT INTO "data_users" ("name", "born", "sex", "office_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_data_user
      @data_user = DataUser.find(params[:id])
---
SELECT  "data_users".* FROM "data_users" WHERE "data_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]