app/controllers/lawsuits_controller.rb

INSERT INTO "lawsuits" ("number", "assessment", "description", "user_id", "client_id", "venue_id", "kind_id", "status_id", "created_at", "updated_at", "amount", "amount_paid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lawsuit = @client.lawsuits.new(lawsuit_params)
    @lawsuit.user_id = current_user.id
    respond_to do |format|
      if @lawsuit.save

UPDATE "lawsuits" SET "amount" = ?, "amount_paid" = ?, "updated_at" = ? WHERE "lawsuits"."id" = ?  [["amount", 45000.0], ["amount_paid", 0.0], ["updated_at", 2016-11-17 05:10:38 UTC], ["id", 8]]
---
  def update
    respond_to do |format|
      if @lawsuit.update(lawsuit_params)

DELETE FROM "lawsuits" WHERE "lawsuits"."id" = ?  [["id", 1]]
---
  def destroy
   @lawsuit.destroy

SELECT "payments".* FROM "payments" WHERE "payments"."lawsuit_id" = ?  [["lawsuit_id", 8]]
---
    def load_payment
      @payment = Payment.where(lawsuit_id: params[:id]).paginate(page: params[:page], per_page: 1)

SELECT "observations".* FROM "observations" WHERE "observations"."lawsuit_id" = ?  [["lawsuit_id", 8]]
---
    def load_observation
      @observation = Observation.where(lawsuit_id: params[:id]).paginate(page: params[:param_name], per_page: 2)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def load_client
      @client = Client.find(params[:client_id])

SELECT  "lawsuits".* FROM "lawsuits" WHERE "lawsuits"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_lawsuit
      @lawsuit = Lawsuit.find(params[:id])