app/controllers/lawsuits_controller.rb

  def index
    if params[:search]
      @lawsuits = Lawsuit.where(number: params[:search])
      if @lawsuits == []
        respond_to do |format|
            format.html { redirect_to lawsuits_url, notice: 'Não foi encontrado.' }
        end
      end
    else
    @lawsuits = Lawsuit.all
---
SELECT "lawsuits".* FROM "lawsuits" WHERE "lawsuits"."number" = ?  [["number", "55"]]
SELECT "lawsuits".* FROM "lawsuits"