app/controllers/observations_controller.rb

  def create
    @observation = @lawsuit.observations.new(observation_params)

    respond_to do |format|
      if @observation.save
---
INSERT INTO "observations" ("description", "lawsuit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "teste"], ["lawsuit_id", 8], ["created_at", 2016-11-17 02:40:36 UTC], ["updated_at", 2016-11-17 02:40:36 UTC]]

  def update
      respond_to do |format|
      if @observation.update(observation_params)
        format.html { redirect_to lawsuit_path(Lawsuit.find(@observation.lawsuit_id)), notice: 'Observation was successfully updated.' }
---
UPDATE "observations" SET "description" = ?, "updated_at" = ? WHERE "observations"."id" = ?  [["description", "teste dfsad"], ["updated_at", 2016-11-17 05:16:48 UTC], ["id", 1]]
SELECT  "lawsuits".* FROM "lawsuits" WHERE "lawsuits"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "observations".* FROM "observations" WHERE "observations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def load_lawsuit
      @lawsuit = Lawsuit.find(params[:lawsuit_id])
---
SELECT  "lawsuits".* FROM "lawsuits" WHERE "lawsuits"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def set_observation
      @observation = Observation.find(params[:id])
---
SELECT  "observations".* FROM "observations" WHERE "observations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]