app/controllers/observations_controller.rb

  def update

    @observation.user_id = current_user.id
    respond_to do |format|
    if @observation.update(observation_params)
      format.html { redirect_to lawsuit_path(Lawsuit.find(@observation.lawsuit_id)), notice: 'Comentário Atualizado.' }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]