app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
---
SELECT  "payments".* FROM "payments" ORDER BY "payments"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @payment = Payment.new(payment_params)

    respond_to do |format|
      if @payment.save
---
INSERT INTO "payments" ("amount", "created_at", "updated_at", "lawsuit_id") VALUES (?, ?, ?, ?)  [["amount", 600.0], ["created_at", 2016-11-18 00:00:30 UTC], ["updated_at", 2016-11-18 00:00:30 UTC], ["lawsuit_id", 8]]

    def load_lawsuit
      @lawsuit = Lawsuit.find(params[:lawsuit_id])
---
SELECT  "lawsuits".* FROM "lawsuits" WHERE "lawsuits"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]